<?php

namespace App\View\Composers;


use Roots\Acorn\View\Composer;

class PartnersModalComposer extends Composer
{
    protected static $views = [
        'components.partners-modal'
    ];

    public function with()
    {
        return [
            'title' => 'Партнерство',
            'leftContent' => "Будівельна компанія ТОВ \"Каркас Груп\" стрімко нарощує власні виробничі потужності та є лідером капітального будівництва об'єктів сільськогосподарського та виробничого призначення.",
            'rightContent' => "Компанія наразі розширює коло надійних партнерів і запрошує до співпраці постачальників зерноочисних/зерносушильних комплексів, допоміжного устаткування складських приміщень (зернові транспортери, кран-балки, системи підлогової вентиляції) та постачальників металопрокату.",
            'phoneLink' => '',
            'phone' => '+38(097) 000-13-97',
            'person' => 'Артем',
            'department' => 'відділ партнерських угод'
        ];
    }
}
